### Report for suspension-service

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- end-of-transfer-service in modules/end-of-transfer-service
- suspension-service in modules/suspension-service
Initializing provider plugins...
- Finding hashicorp/aws versions matching "5.59.0"...
- Finding latest version of hashicorp/archive...
- Installing hashicorp/aws v5.59.0...
- Installed hashicorp/aws v5.59.0 (signed by HashiCorp)
- Installing hashicorp/archive v2.7.1...
- Installed hashicorp/archive v2.7.1 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (2 to add, 2 to change, 7 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.ecs-service will be updated in-place
  ~ resource "aws_ecs_service" "ecs-service" {
        id                                 = "arn:aws:ecs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:service/dev-suspension-service-ecs-cluster/dev-suspension-service"
        name                               = "dev-suspension-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:task-definition/suspension-service:438" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:task-definition/suspension-service:438" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:task-definition/suspension-service" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "suspension-service" -> (known after apply)
      ~ revision                 = 438 -> (known after apply)
        tags                     = {
            "CreatedBy"   = "suspension-service"
            "Environment" = "dev"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_ssm_parameter.active_suspensions_kms_key_id must be replaced
-/+ resource "aws_ssm_parameter" "active_suspensions_kms_key_id" {
      ~ arn             = "arn:aws:ssm:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:parameter/repo/dev/output/suspension-service/active-suspensions-kms-key-id" -> (known after apply)
      ~ data_type       = "text" -> (known after apply)
      ~ id              = "/repo/dev/output/suspension-service/active-suspensions-kms-key-id" -> (known after apply)
      + insecure_value  = (known after apply)
      + key_id          = (known after apply)
      ~ name            = "/repo/dev/output/suspension-service/active-suspensions-kms-key-id" -> "/repo/dev/output/prm-deductions-infra/active-suspensions-kms-key-id" # forces replacement
        tags            = {
            "CreatedBy"   = "suspension-service"
            "Environment" = "dev"
        }
      ~ tier            = "Standard" -> (known after apply)
      ~ version         = 1 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.suspension-service[0].aws_appautoscaling_policy.scale_down will be destroyed
  # (because aws_appautoscaling_policy.scale_down is not in configuration)
  - resource "aws_appautoscaling_policy" "scale_down" {
      - alarm_arns         = [
          - "arn:aws:cloudwatch:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:alarm:dev-suspension-service-scale-down",
        ] -> null
      - arn                = "arn:aws:autoscaling:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:scalingPolicy:8c8c09d9-c430-4c31-8442-54ce24b8a5b5:resource/ecs/service/dev-suspension-service-ecs-cluster/dev-suspension-service:policyName/scale-down" -> null
      - id                 = "scale-down" -> null
      - name               = "scale-down" -> null
      - policy_type        = "StepScaling" -> null
      - resource_id        = "service/dev-suspension-service-ecs-cluster/dev-suspension-service" -> null
      - scalable_dimension = "ecs:service:DesiredCount" -> null
      - service_namespace  = "ecs" -> null

      - step_scaling_policy_configuration {
          - adjustment_type          = "ChangeInCapacity" -> null
          - cooldown                 = 60 -> null
          - metric_aggregation_type  = "Maximum" -> null
          - min_adjustment_magnitude = 0 -> null

          - step_adjustment {
              - metric_interval_lower_bound = "0" -> null
              - scaling_adjustment          = -1 -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.suspension-service[0].aws_appautoscaling_policy.scale_up will be destroyed
  # (because aws_appautoscaling_policy.scale_up is not in configuration)
  - resource "aws_appautoscaling_policy" "scale_up" {
      - alarm_arns         = [
          - "arn:aws:cloudwatch:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:alarm:dev-suspension-service-scale-up",
        ] -> null
      - arn                = "arn:aws:autoscaling:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:scalingPolicy:8c8c09d9-c430-4c31-8442-54ce24b8a5b5:resource/ecs/service/dev-suspension-service-ecs-cluster/dev-suspension-service:policyName/scale-up" -> null
      - id                 = "scale-up" -> null
      - name               = "scale-up" -> null
      - policy_type        = "StepScaling" -> null
      - resource_id        = "service/dev-suspension-service-ecs-cluster/dev-suspension-service" -> null
      - scalable_dimension = "ecs:service:DesiredCount" -> null
      - service_namespace  = "ecs" -> null

      - step_scaling_policy_configuration {
          - adjustment_type          = "ChangeInCapacity" -> null
          - cooldown                 = 60 -> null
          - metric_aggregation_type  = "Maximum" -> null
          - min_adjustment_magnitude = 0 -> null

          - step_adjustment {
              - metric_interval_lower_bound = "0" -> null
              - scaling_adjustment          = 1 -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.suspension-service[0].aws_appautoscaling_target.ecs_target will be destroyed
  # (because aws_appautoscaling_target.ecs_target is not in configuration)
  - resource "aws_appautoscaling_target" "ecs_target" {
      - id                 = "service/dev-suspension-service-ecs-cluster/dev-suspension-service" -> null
      - max_capacity       = 1 -> null
      - min_capacity       = 0 -> null
      - resource_id        = "service/dev-suspension-service-ecs-cluster/dev-suspension-service" -> null
      - role_arn           = "[REDACTED_IAM_ROLE_ARN]/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> null
      - scalable_dimension = "ecs:service:DesiredCount" -> null
      - service_namespace  = "ecs" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
        # (1 unchanged attribute hidden)
    }

  # module.suspension-service[0].aws_cloudwatch_metric_alarm.suspension_service_scale_down_alarm will be destroyed
  # (because aws_cloudwatch_metric_alarm.suspension_service_scale_down_alarm is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "suspension_service_scale_down_alarm" {
      - actions_enabled                       = false -> null
      - alarm_actions                         = [
          - "arn:aws:autoscaling:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:scalingPolicy:8c8c09d9-c430-4c31-8442-54ce24b8a5b5:resource/ecs/service/dev-suspension-service-ecs-cluster/dev-suspension-service:policyName/scale-down",
        ] -> null
      - alarm_description                     = "Alarm to alert when all events are processed in the queue" -> null
      - alarm_name                            = "dev-suspension-service-scale-down" -> null
      - arn                                   = "arn:aws:cloudwatch:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:alarm:dev-suspension-service-scale-down" -> null
      - comparison_operator                   = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {
          - "QueueName" = "dev-suspension-service-suspensions"
        } -> null
      - evaluation_periods                    = 1 -> null
      - id                                    = "dev-suspension-service-scale-down" -> null
      - insufficient_data_actions             = [] -> null
      - metric_name                           = "NumberOfEmptyReceives" -> null
      - namespace                             = "AWS/SQS" -> null
      - ok_actions                            = [] -> null
      - period                                = 300 -> null
      - statistic                             = "Sum" -> null
      - tags                                  = {} -> null
      - tags_all                              = {} -> null
      - threshold                             = 70 -> null
      - treat_missing_data                    = "notBreaching" -> null
        # (4 unchanged attributes hidden)
    }

  # module.suspension-service[0].aws_cloudwatch_metric_alarm.suspension_service_scale_up_alarm will be destroyed
  # (because aws_cloudwatch_metric_alarm.suspension_service_scale_up_alarm is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "suspension_service_scale_up_alarm" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:autoscaling:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:scalingPolicy:8c8c09d9-c430-4c31-8442-54ce24b8a5b5:resource/ecs/service/dev-suspension-service-ecs-cluster/dev-suspension-service:policyName/scale-up",
        ] -> null
      - alarm_description                     = "Scale up alarm for suspension-service" -> null
      - alarm_name                            = "dev-suspension-service-scale-up" -> null
      - arn                                   = "arn:aws:cloudwatch:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:alarm:dev-suspension-service-scale-up" -> null
      - comparison_operator                   = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      - evaluation_periods                    = 1 -> null
      - id                                    = "dev-suspension-service-scale-up" -> null
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - period                                = 0 -> null
      - tags                                  = {} -> null
      - tags_all                              = {} -> null
      - threshold                             = 10 -> null
      - treat_missing_data                    = "missing" -> null
        # (7 unchanged attributes hidden)

      - metric_query {
          - id          = "m1" -> null
          - period      = 0 -> null
          - return_data = false -> null
            # (3 unchanged attributes hidden)

          - metric {
              - dimensions  = {
                  - "QueueName" = "dev-suspension-service-suspensions"
                } -> null
              - metric_name = "NumberOfMessagesReceived" -> null
              - namespace   = "AWS/SQS" -> null
              - period      = 180 -> null
              - stat        = "Sum" -> null
              - unit        = "Count" -> null
            }
        }
      - metric_query {
          - expression  = "IF (( (MINUTE(m1)>=0 )),10, 0)" -> null
          - id          = "e1" -> null
          - label       = "Expression" -> null
          - period      = 0 -> null
          - return_data = true -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.suspension-service[0].aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = "/dojo/work/terraform/../lambda/orc_ingestion_payload.zip" -> "./../../../lambdas/orc-ingestion-lambda/build/orc_ingestion_payload.zip"
        id                             = "dev_orc_ingestion"
      ~ last_modified                  = "2024-07-22T13:55:16.000+0000" -> (known after apply)
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 7 to destroy.
```

</details>